In [118]:
import numpy as np
import pandas as pd

In [132]:
from numpy.random import randn

In [133]:
np.random.seed(101) #make sure to get same random number

In [134]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Now each of these columns is actually just a panda's series.
So W is a panda series as well as X ,Y and Z and they all share a common index and
that's basically all data frame is it's just a bunch of series that share same index.

In [135]:
df['W'] # here the series is returned with index ['A','B','C','D','E'] .THAT why data frame is it's just a bunch of series that share same index.return series

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [136]:
type(df['W'])

pandas.core.series.Series

In [137]:
type(df)

pandas.core.frame.DataFrame

# column

In [138]:
df.W #this also helps in acces of series but its lead to confuse to identify after the (.) is method or col name

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [139]:
df[['W','X']] # for acess multipe column pass by list.return data frame

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [140]:
type(df[['W','X']])

pandas.core.frame.DataFrame

In [141]:
df['new']

KeyError: 'new'

In [142]:
df['new']=df['W']+df['X']  # to create new column
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [143]:
df.drop('new') #by default axis=0-> row but we made drop in row for that axis=1

KeyError: "['new'] not found in axis"

In [144]:
df.drop('new',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [145]:
df #but we still have new ,by default inplace=false with the changes not affected in orginal.helps in accident lost of data

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [146]:
df.drop('new',axis=1,inplace=True)

In [147]:
df #now its droped from orginal

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

# row

In [148]:
df.loc['C'] # access by lable base index

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [149]:
df.iloc[2] # access by numerical base index, even though it has lable in string.

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [150]:
df.loc[['A','B','C']] #acess multiple rows

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001

In [151]:
df.loc['B','Y'] # like numpy ,here also we acess single value by[row,col]

np.float64(-0.8480769834036315)

In [152]:
df.loc[['A','B'],['X','Y','Z']] # to get subset from matrix

          X         Y         Z
A  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965

In [153]:
df.iloc[[0,1],[0,1,2]]

          W         X         Y
A  2.706850  0.628133  0.907969
B  0.651118 -0.319318 -0.848077

# condition

A very important feature of pandas is the ability to perform condition and selection using bracket notation.

In [1]:
import numpy as np
import pandas as pd

In [4]:
from numpy.random import randn

In [5]:
np.random.seed(101)

In [6]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [7]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [9]:
booldf = df > 0 # return in true or false basis

In [ ]:
df[booldf] # when we pass booldf ,true -> values, false -> NaN

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

 now  passing in a series I don't get those NaN values anymore.
 You only get those NaN values when you're doing this sort of A condition on an entire data frame 
 when you're actually passing in conditions based off   of columns.
 You'll just get series values meaning you'll get only the rows were happens to be true.

# By column

In [33]:
df['W']>0 # series

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [34]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [35]:
# grab all the rows in my data frame where z is less than zero.
df[df['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [36]:
# after filter in the returned subset .I want a particular row or col
result = df[df['W']>0]

In [37]:
result

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [38]:
result['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [39]:
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [ ]:
df[df['W']>0][['X','Y','Z']] # pass list to get multiple columns

          X         Y         Z
A  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965
D -0.758872 -0.933237  0.955057
E  1.978757  2.605967  0.683509

In [ ]:
boolseries = df['W']>0
result = df[boolseries]
my_col = ['X','Y','Z']
result[my_col]              # both are same ,but use above one to reduce memory use.

          X         Y         Z
A  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965
D -0.758872 -0.933237  0.955057
E  1.978757  2.605967  0.683509

# multiple conditions

Contional operator in pyhton take only(single boolean<-operator->single boolean) not (series of boolean<-operator->series of boolean)

In [50]:
df[(df['W']>0) and (df['Y']>1)] #(series of boolean<-operator->series of boolean) got confused to over these case use (and -> &, or -> |)

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [51]:
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [52]:
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [53]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [60]:
# to set a numerical index ,and create a new column "index",it has inplace to make it perment
df.reset_index()

  index         W         X         Y         Z State
0     A  2.706850  0.628133  0.907969  0.503826    AS
1     B  0.651118 -0.319318 -0.848077  0.605965    HG
2     C -2.018168  0.740122  0.528813 -0.589001    JK
3     D  0.188695 -0.758872 -0.933237  0.955057    ND
4     E  0.190794  1.978757  2.605967  0.683509    SK

In [61]:
new_ind = 'AS HG JK ND SK'.split() # return in list .
df['State']=new_ind
df

          W         X         Y         Z State
A  2.706850  0.628133  0.907969  0.503826    AS
B  0.651118 -0.319318 -0.848077  0.605965    HG
C -2.018168  0.740122  0.528813 -0.589001    JK
D  0.188695 -0.758872 -0.933237  0.955057    ND
E  0.190794  1.978757  2.605967  0.683509    SK

In [62]:
df.set_index('State') #to set column as index,it has inplace to make it perment

              W         X         Y         Z
State
AS     2.706850  0.628133  0.907969  0.503826
HG     0.651118 -0.319318 -0.848077  0.605965
JK    -2.018168  0.740122  0.528813 -0.589001
ND     0.188695 -0.758872 -0.933237  0.955057
SK     0.190794  1.978757  2.605967  0.683509

set_index replaces your existing index with a column,
and unless you explicitly keep or reset it later,
the old index is overwritten and not retained as a column.
reset_index does the opposite: it allows the index to be retained as a new column while restoring a default index.

# Multi-Index and Index Hierarchy

In [99]:
import pandas as pd
import numpy as np
from numpy.random import randn

In [100]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [101]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [102]:
inside

[1, 2, 3, 1, 2, 3]

In [103]:
list(zip(outside,inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [ ]:
pd.MultiIndex.from_tuples(hier_index)

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [112]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])
df # example for multi-index

             A         B
G1 1 -1.005187 -0.741790
   2  0.187125 -0.732845
   3 -1.382920  1.482495
G2 1  0.961458 -2.141212
   2  0.992573  1.192241
   3 -1.046780  1.292765

In [113]:
# access data from multi level index, frst acces outside index then go deeper.
df.loc['G1']

          A         B
1 -1.005187 -0.741790
2  0.187125 -0.732845
3 -1.382920  1.482495

In [115]:
df.loc['G1'].loc[1] # return in series

A   -1.005187
B   -0.741790
Name: 1, dtype: float64

In [123]:
# give naming for indexies
df.index.names = ['Groups','Num']
df

                   A         B
Groups Num
G1     1   -1.005187 -0.741790
       2    0.187125 -0.732845
       3   -1.382920  1.482495
G2     1    0.961458 -2.141212
       2    0.992573  1.192241
       3   -1.046780  1.292765

In [124]:
# access single data
df.loc['G2'].loc[1]['A']

np.float64(0.9614581560918355)

In [125]:
#cross section it has the ability to skip or go inside a multilevel index
df.xs

<bound method NDFrame.xs of                    A         B
Groups Num
G1     1   -1.005187 -0.741790
       2    0.187125 -0.732845
       3   -1.382920  1.482495
G2     1    0.961458 -2.141212
       2    0.992573  1.192241
       3   -1.046780  1.292765>

In [126]:
df.xs('G1')

            A         B
Num
1   -1.005187 -0.741790
2    0.187125 -0.732845
3   -1.382920  1.482495

In [128]:
# if i want row 1 fronm both g1 and g2 
df.xs(1,level='Num')

               A         B
Groups
G1     -1.005187 -0.741790
G2      0.961458 -2.141212